/*******************************************************************************
*
*	タイトル：	テクスチャクラス	[ texture.cpp ]
*
*	作成者：	古本 泰隆
*
*******************************************************************************/
#include "texture.h"
#include "renderer.h"

/*******************************************************************************
*	ロード
*******************************************************************************/
void Texture::Load()
{
	// 既にロード済みの場合は即終了する
	if (m_IsLoaded) { return; }

	// テクスチャ読み込み
	D3DX11CreateShaderResourceViewFromFile(Renderer::GetDevice(),
											m_Path,
											NULL,
											NULL,
											&m_TextureResource,
											NULL);
	assert(m_TextureResource);

	m_IsLoaded = true;
}

/*******************************************************************************
*	アンロード
*******************************************************************************/
void Texture::Unload()
{
	// ロードが行われていない場合即終了する
	if (!m_IsLoaded) { return; }

	m_TextureResource->Release();

	m_IsLoaded = false;
}
